const changelogData = [
	{
		version: '1.0.1',
		date: '13.02.2025',
		changes: [
			'Исправлены мелкие ошибки',
			'Добавлена поддержка динамических QR-кодов',
			'Добавлена возможность управления ссылками динамических QR',
			'Добавлена история изменений',
		],
	},
	{
		version: '1.1.0',
		date: '09.02.2025',
		changes: [
			'Улучшен внешний вид QR-кода',
			'Добавлена кастомизация QR-кода',
			'Улучшен внешний вид QR-кода',
			'Добавлена история генераций QR-кодов',
		],
	},
	{
		version: '1.0.0',
		date: '05.02.2025',
		changes: [
			'Улучшена производительность',
			'Проект выложен на GitHub',
			'Добавлена документация',
		],
	},
	{
		version: '0.0.1',
		date: '05.12.2024',
		changes: [
			'Проект создан',
			'Добавлены русский и английский язык',
			'Добавлена тёмная тема',
			'Добавлено скачивание QR-кода в PNG-формате',
		],
	},
];
